Repository: kirinonakar/TxtAIEditor
Catalog: TxtAIEditor/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans, zh_hant

source: Open File
ja_jp: ファイルを開く
zh_hans: 打开文件
zh_hant: 開啟檔案

# SaveFile
source: Save
ja_jp: 保存
zh_hans: 保存
zh_hant: 儲存

# SaveAsFile
source: Save As
ja_jp: 名前を付けて保存
zh_hans: 另存为
zh_hant: 另存新檔

source: Compare
ja_jp: 比較
zh_hans: 比较
zh_hant: 比較

source: Terminal
ja_jp: ターミナル
zh_hans: 终端
zh_hant: 終端機

source: TopMost
ja_jp: 常に手前
zh_hans: 置顶
zh_hant: 置頂

# StickyNote
source: Sticky
ja_jp: 付箋
zh_hans: 粘性
zh_hant: 黏性

source: Word Wrap
ja_jp: 右端で折り返す
zh_hans: 自动换行
zh_hant: 自動換行

source: Search
ja_jp: 検索
zh_hans: 搜索
zh_hant: 搜尋

# CsvTableTooltip
source: Display CSV and JSON as a table
ja_jp: CSVとJSONをテーブル形式で表示
zh_hans: 以表格形式显示 CSV 和 JSON
zh_hant: 以表格形式顯示 CSV 和 JSON

# CsvNameBoxPlaceholder
source: Cell
ja_jp: セル
zh_hans: 细胞
zh_hant: 細胞

# CsvFormulaPlaceholder
source: Selected CSV cell value
ja_jp: 選択したCSVセルの値
zh_hans: 选定的 CSV 单元格值
zh_hant: 選定的 CSV 單元格值

# CsvJsonKeyHeader
source: Key
ja_jp: キー
zh_hans: 键
zh_hant: 鍵

# CsvJsonValueHeader
source: Value
ja_jp: 値
zh_hans: 值
zh_hant: 值

source: Theme
ja_jp: テーマ
zh_hans: 主题
zh_hant: 主題

source: Split
ja_jp: 分割
zh_hans: 斯普利特
zh_hant: 斯普利特

source: Settings
ja_jp: 設定
zh_hans: 设置
zh_hant: 設定

# FolderSelect
source: Select Folder...
ja_jp: フォルダ選択...
zh_hans: 选择文件夹...
zh_hant: 選擇資料夾...

# NoFolderSelected
source: Please select a folder.
ja_jp: フォルダを選択してください。
zh_hans: 请选择一个文件夹。
zh_hant: 請選擇一個資料夾。

# ExplorerItemCountSingular
source: {0:N0} item
ja_jp: {0:N0}項目
zh_hans: {0:N0} 项目
zh_hant: {0:N0} 項目

# ExplorerItemCountPlural
source: {0:N0} items
ja_jp: {0:N0}項目
zh_hans: {0:N0} 项目
zh_hant: {0:N0} 項目

# FavoritesHeader
source: Favorites List
ja_jp: お気に入りリスト
zh_hans: 收藏夹列表
zh_hant: 收藏夾列表

# SnippetsHeader
source: Code & Formula Templates
ja_jp: コードと数式テンプレート
zh_hans: 代码和公式模板
zh_hant: 程式碼和公式模板

source: Add Snippet...
ja_jp: スニペット追加...
zh_hans: 添加片段...
zh_hant: 新增片段...

# SplitNone
source: No Split (Single)
ja_jp: 分割なし (単一)
zh_hans: 无分割（单）
zh_hant: 無分割（單）

# SplitVertical
source: Split Vertically
ja_jp: 左右に分割
zh_hans: 垂直分割
zh_hant: 垂直分割

# SplitHorizontal
source: Split Horizontally
ja_jp: 上下に分割
zh_hans: 水平分割
zh_hant: 水平分割

# LanguageChangedTitle
source: Language Change
ja_jp: 言語の変更
zh_hans: 语言更改
zh_hant: 語言變更

# LanguageChangedMessage
source: You must restart the application to apply the language settings. Would you like to restart now?
ja_jp: 言語設定を適用するにはアプリケーションを再起動する必要があります。今すぐ再起動しますか？
zh_hans: 必须重启应用才能应用语言设置。是否立即重启？
zh_hant: 必須重新啟動應用程式才能套用語言設定。是否立即重新啟動？

source: Yes
ja_jp: はい
zh_hans: 是
zh_hant: 是

source: No
ja_jp: いいえ
zh_hans: 否
zh_hant: 否

source: Restart
ja_jp: 再起動
zh_hans: 重启
zh_hant: 重新啟動

# LanguageDefault
source: Default (OS Language)
ja_jp: デフォルト (OS設定)
zh_hans: 默认（系统语言）
zh_hant: 預設（系統語言）

# LanguageKorean
source: Korean
ja_jp: 韓国語
zh_hans: 韩语
zh_hant: 韓文

# LanguageEnglish
source: English
zh_hans: 英语
zh_hant: 英文

# LanguageJapanese
source: Japanese
ja_jp: 日本語
zh_hans: 日语
zh_hant: 日文

# LanguageChineseSimplified
source: Chinese (Simplified)
ja_jp: 简体中文
zh_hans: 简体中文
zh_hant: 簡體中文

# LanguageChineseTraditional
source: Chinese (Traditional)
ja_jp: 繁體中文
zh_hans: 繁体中文
zh_hant: 繁體中文

source: Print
ja_jp: 印刷
zh_hans: 打印
zh_hant: 列印

source: Explorer
ja_jp: エクスプローラー
zh_hans: 资源管理器
zh_hant: 檔案總管

source: Favorites
ja_jp: お気に入り
zh_hans: 收藏夹
zh_hant: 我的最愛

source: Snippets
ja_jp: スニペット
zh_hans: 片段
zh_hant: 片段

source: Recent Files
ja_jp: 最近のファイル
zh_hans: 最近使用的文件
zh_hant: 最近使用的檔案

source: Heading
ja_jp: 見出し
zh_hans: 标题
zh_hant: 標題

source: Bold
ja_jp: 太字
zh_hans: 大胆
zh_hant: 大膽

source: Italic
ja_jp: 斜体
zh_hans: 斜体
zh_hant: 斜體

source: Underline
ja_jp: 下線
zh_hans: 下划线
zh_hant: 底線

source: Highlight
ja_jp: 蛍光ペン
zh_hans: High光
zh_hant: High光

source: Unordered List
ja_jp: 箇条書き
zh_hans: 无序列表
zh_hant: 無序列表

source: Cut Line
ja_jp: 現在の行を切り取り
zh_hans: 切割线
zh_hant: 切割線

source: Quote
ja_jp: 引用
zh_hans: 报价
zh_hant: 報價

source: Arrow
ja_jp: 矢印
zh_hans: 箭头
zh_hant: 箭頭

source: Inline Code
ja_jp: インラインコード
zh_hans: 内联代码
zh_hant: 內聯程式碼

source: Tasklist
ja_jp: チェックリスト
zh_hans: 任务清单
zh_hant: 任務清單

source: Convert to Table
ja_jp: テーブルに変換
zh_hans: 转换为 Table
zh_hant: 轉換為 Table

source: Font Increase
ja_jp: フォントサイズ拡大
zh_hans: 字体增大
zh_hant: 字體增大

source: Font Decrease
ja_jp: フォントサイズ縮小
zh_hans: 字体缩小
zh_hant: 字體縮小

# TextColor
source: Text Color (Right-click: Select Color)
ja_jp: 文字色 (右クリック: 色選択)
zh_hans: 文本颜色（右键单击：选择颜色）
zh_hant: 文字顏色（右鍵：選擇顏色）

source: Link
ja_jp: リンク
zh_hans: 链接
zh_hant: 連結

source: Image
ja_jp: 画像
zh_hans: 图片
zh_hant: 圖片

# CharMap
source: Character Map
ja_jp: 文字の選択
zh_hans: 字符映射表
zh_hant: 字元映射表

source: Emoji
ja_jp: 絵文字
zh_hans: 表情符号
zh_hant: 表情符號

source: Current Date
ja_jp: 現在の日付
zh_hans: 当前日期
zh_hant: 目前日期

# SettingsTitle
source: TxtAIEditor Settings
ja_jp: TxtAIEditor 設定
zh_hans: TxtAIEditor 设置
zh_hant: TxtAIEditor 設定

# SettingsSave
source: Save & Apply
ja_jp: 適用して保存
zh_hans: 保存并应用
zh_hant: 儲存並套用

# SettingsCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# SettingsAppearance
source: Appearance
ja_jp: 外観
zh_hans: 外观
zh_hant: 外觀

# SettingsEditing
source: Editing
ja_jp: 編集
zh_hans: 编辑
zh_hant: 編輯

# SettingsTerminal
source: Terminal
ja_jp: ターミナル
zh_hans: 终端
zh_hant: 終端機

# SettingsTerminalProfile
source: Terminal Shell
ja_jp: ターミナル シェル
zh_hans: 终端外壳
zh_hant: 終端外殼

# SettingsTerminalFontFamily
source: Terminal Font Family
ja_jp: ターミナル フォント
zh_hans: 终端字体系列
zh_hant: 終端字體系列

# SettingsTerminalFontSize
source: Terminal Font Size
ja_jp: ターミナルの文字サイズ
zh_hans: 终端字体大小
zh_hant: 終端字體大小

# SettingsTerminalProfileInfo
source: PowerShell automatically uses PowerShell 7 (pwsh) when it is installed. You can also choose CMD, Git Bash, or WSL. New settings apply to newly opened terminals.
ja_jp: PowerShell は PowerShell 7 (pwsh) がインストールされている場合、自動的に PowerShell 7 を使用します。CMD、Git Bash、WSL も選択できます。新しい設定は次に開くターミナルから適用されます。
zh_hans: PowerShell 安装时自动使用 PowerShell 7 (pwsh)。您还可以选择 CMD、Git Bash 或 WSL。新设置适用于新开放的终端。
zh_hant: PowerShell 安裝時自動使用 PowerShell 7 (pwsh)。您也可以選擇 CMD、Git Bash 或 WSL。新設定適用於新開放的終端。

# SettingsTerminalNotFound
source: Not installed
ja_jp: 未インストール
zh_hans: 未安装
zh_hant: 未安裝

# SettingsLanguage
source: Application Language
ja_jp: アプリケーションの言語
zh_hans: 应用语言
zh_hant: 應用程式語言

# SettingsTheme
source: App & Editor Theme
ja_jp: アプリとエディタのテーマ
zh_hans: 应用和编辑器主题
zh_hant: 應用程式與編輯器佈景主題

# SettingsFontSize
source: Editor Font Size
ja_jp: エディタの文字サイズ
zh_hans: 编辑器字号
zh_hant: 編輯器字級

# SettingsFontFamily
source: Editor Font Family
ja_jp: エディタのフォント
zh_hans: 编辑器字体
zh_hant: 編輯器字型

# SettingsUiFontFamily
source: UI Shell Font Family
ja_jp: UI シェルのフォント
zh_hans: 界面字体
zh_hant: 介面字型

# SettingsUseCustomBg
source: Use Custom Editor Background Color
ja_jp: カスタム背景色を使用する
zh_hans: 使用自定义编辑器背景色
zh_hant: 使用自訂編輯器背景色

# SettingsUseCustomFg
source: Use Custom Editor Foreground Color
ja_jp: カスタム文字色を使用する
zh_hans: 使用自定义编辑器前景色
zh_hant: 使用自訂編輯器前景色

# SettingsWordWrap
source: Enable Word Wrap by Default
ja_jp: デフォルトで右端折り返しを有効にする
zh_hans: 默认启用自动换行
zh_hant: 預設啟用自動換行

# SettingsSyntaxHighlighting
source: Enable Syntax Highlighting
zh_hans: 启用语法高亮
zh_hant: 啟用語法醒目提示

# SettingsShowDirtyLines
source: Show Dirty Lines
zh_hans: 显示已修改行
zh_hant: 顯示已修改行

# SettingsBracketPair
source: Bracket Pair Colorization
ja_jp: ブラケットペアのカラー表示
zh_hans: 括号对着色
zh_hant: 括號配對著色

# SettingsAutocompleteEnter
source: Auto-complete with Enter
ja_jp: Enterで自動補完
zh_hans: 按 Enter 自动完成
zh_hant: 按 Enter 自動完成

# SettingsAutocompleteTab
source: Auto-complete with Tab
ja_jp: Tabで自動補完
zh_hans: 按 Tab 自动完成
zh_hant: 按 Tab 自動完成

# SettingsAutocomplete
source: Enable Autocomplete
ja_jp: 自動補完機能を使用する
zh_hans: 启用自动完成
zh_hant: 啟用自動完成

# SettingsAutoSave
source: Use Autosave
ja_jp: 自動保存を使用する
zh_hans: 使用自动保存
zh_hant: 使用自動儲存

# SettingsAutoSaveAllowNonGitFolders
source: Allow Autosave outside Git folders
ja_jp: Gitフォルダー以外でも自動保存を許可する
zh_hans: 允许在 Git 文件夹外部自动保存
zh_hant: 允許在 Git 資料夾外部自動儲存

# SettingsLivePreview
source: Enable Preview by Default
ja_jp: デフォルトでプレビューを有効にする
zh_hans: 默认启用预览
zh_hant: 預設啟用預覽

# SettingsMarkdownToolbar
source: Enable Markdown Toolbar by Default
ja_jp: デフォルトでMarkdownツールバーを表示する
zh_hans: 默认启用 Markdown 工具栏
zh_hant: 預設啟用 Markdown 工具列

# SettingsStartInTreeMode
source: Start in Tree Mode
zh_hant: 樹狀模式啟動

# SettingsToolbar
source: Toolbar
ja_jp: ツールバー
zh_hans: 工具栏
zh_hant: 工具列

# SettingsToolbarShowLabels
source: Show Toolbar Button Labels
ja_jp: ツールバーボタンのラベルを表示
zh_hans: 显示工具栏按钮标签
zh_hant: 顯示工具列按鈕標籤

# SettingsToolbarOrderHint
source: Drag to reorder buttons (Settings button is fixed)
ja_jp: ドラッグしてボタンの順序を変更（設定ボタンは固定）
zh_hans: 拖动以重新排序按钮（设置按钮已修复）
zh_hant: 拖曳以重新排序按鈕（設定按鈕已修復）

# SettingsTabSize
source: Tab Size
ja_jp: タブサイズ
zh_hans: Tab 大小
zh_hant: Tab 大小

# SettingsLlmProvider
source: LLM Provider
ja_jp: LLM プロバイダー
zh_hans: LLM 提供商
zh_hant: LLM 提供者

# SettingsLlmEndpoint
source: LLM API Endpoint
ja_jp: LLM API エンドポイント
zh_hans: LLM API 端点
zh_hant: LLM API 端點

# SettingsLlmModel
source: LLM Model
ja_jp: LLM モデル名
zh_hans: LLM 模型
zh_hant: LLM 模型

# SettingsLlmLoadModels
source: Load LM Studio Models
ja_jp: LM Studioモデルを取得
zh_hans: 加载LM Studio型号
zh_hant: 加載LM Studio型號

# SettingsLlmInfo
source: LM Studio loads the list of models from http://localhost:1234/v1/models when the server is running.
ja_jp: LM Studioは、サーバーが起動しているときに http://localhost:1234/v1/models からモデルリストを取得します。
zh_hans: 当服务器运行时，LM Studio 从 http://localhost:1234/v1/models 加载模型列表。
zh_hant: 當伺服器運行時，LM Studio 從 http://localhost:1234/v1/models 載入模型清單。

# SettingsLlmSelectModel
source: Select Model
ja_jp: モデル選択
zh_hans: 选择型号
zh_hant: 選擇型號

# SettingsLlmApiKeyPlaceholder
source: Enter API Key (Leave empty to delete saved Key)
ja_jp: APIキーを入力（空欄にすると保存されたキーを削除）
zh_hans: Enter API Key（留空以删除已保存的密钥）
zh_hant: Enter API Key（留空以刪除已儲存的金鑰）

# SettingsLlmEndpointPlaceholder
source: e.g., http://localhost:1234/v1
ja_jp: 例: http://localhost:1234/v1
zh_hans: 例如，http://localhost:1234/v1
zh_hant: 例如，http://localhost:1234/v1

# SettingsLlmLoadModelsNotSupported
source: This provider does not support loading models.
ja_jp: このプロバイダーはモデルの読み込みをサポートしていません。
zh_hans: 该提供程序不支持加载模型。
zh_hant: 該提供者不支援載入模型。

# SettingsLlmLoadingModelsFormat
source: Loading model list for {0}...
ja_jp: {0} のモデルリストを読み込んでいます...
zh_hans: 正在加载 {0} 的型号列表...
zh_hant: 正在加載 {0} 的型號列表...

# SettingsLlmModelsLoadedFormat
source: Loaded {0} models.
ja_jp: {0} 個のモデルを読み込みました。
zh_hans: 已加载 {0} 型号。
zh_hant: 已載入 {0} 型號。

# SettingsLlmNoModelsFoundFormat
source: No available models found in {0}.
ja_jp: {0} で利用可能なモデルが見つかりませんでした。
zh_hans: {0} 中未找到可用型号。
zh_hant: {0} 中找不到可用型號。

# SettingsLlmLoadModelsFailedFormat
source: Failed to load model list for {0}: {1}
ja_jp: {0} のモデルリストを読み込めませんでした: {1}
zh_hans: 无法加载 {0} 的型号列表：{1}
zh_hant: 無法載入 {0} 的型號清單：{1}

# SettingsLlmLoadOpenRouterModels
source: Load OpenRouter Models
ja_jp: OpenRouterモデルを取得
zh_hans: 加载OpenRouter型号
zh_hant: 加載OpenRouter型號

# SettingsLlmOpenRouterInfo
source: OpenRouter loads the list of models from https://openrouter.ai/api/v1/models.
ja_jp: OpenRouterは https://openrouter.ai/api/v1/models からモデルリストを取得します。
zh_hans: OpenRouter 从 https://openrouter.ai/api/v1/models. 加载模型列表
zh_hant: OpenRouter 從 https://openrouter.ai/api/v1/models. 載入模型列表

# SettingsLlmLoadCerebrasModels
source: Load Cerebras Models
ja_jp: Cerebrasモデルを取得
zh_hans: 加载Cerebras型号
zh_hant: 加載Cerebras型號

# SettingsLlmCerebrasInfo
source: Cerebras loads the list of models from https://api.cerebras.ai/v1/models.
ja_jp: Cerebrasは https://api.cerebras.ai/v1/models からモデルリストを取得します。
zh_hans: Cerebras 从 https://api.cerebras.ai/v1/models. 加载模型列表
zh_hant: Cerebras 從 https://api.cerebras.ai/v1/models. 載入模型列表

# SettingsLlmThinkingLevel
source: Thinking Level
zh_hans: 思维层面
zh_hant: 思維層面

# SettingsLlmLoadOpenCodeGoModels
source: Load OpenCode Go Models
ja_jp: OpenCode Goモデルを取得
zh_hans: 加载 OpenCode Go 模型
zh_hant: 載入 OpenCode Go 模型

# SettingsLlmOpenCodeGoInfo
source: OpenCode Go loads the list of models from https://opencode.ai/zen/go/v1/models.
ja_jp: OpenCode Goは https://opencode.ai/zen/go/v1/models からモデルリストを取得します。
zh_hans: OpenCode Go 从 https://opencode.ai/zen/go/v1/models. 加载模型列表
zh_hant: OpenCode Go 從 https://opencode.ai/zen/go/v1/models. 載入模型列表

# SettingsLlmLoadOpenCodeZenModels
source: Load OpenCode Zen Models
ja_jp: OpenCode Zenモデルを取得
zh_hans: 加载 OpenCode Zen 型号
zh_hant: 加載 OpenCode Zen 型號

# SettingsLlmOpenCodeZenInfo
source: OpenCode Zen loads the list of models from https://opencode.ai/zen/v1/models.
ja_jp: OpenCode Zenは https://opencode.ai/zen/v1/models からモデルリストを取得します。
zh_hans: OpenCode Zen 加载 https://opencode.ai/zen/v1/models. 的型号列表
zh_hant: OpenCode Zen 載入 https://opencode.ai/zen/v1/models. 的型號列表

# SettingsLlmLoadOllamaModels
source: Load Ollama Models
ja_jp: Ollamaモデルを取得
zh_hans: 加载Ollama型号
zh_hant: 加載Ollama型號

# SettingsLlmOllamaInfo
source: Ollama loads the list of models from http://localhost:11434/v1/models when the server is running.
ja_jp: Ollamaは、サーバーが起動しているときに http://localhost:11434/v1/models からモデルリストを取得します。
zh_hans: 当服务器运行时，Ollama 从 http://localhost:11434/v1/models 加载模型列表。
zh_hant: 當伺服器運行時，Ollama 從 http://localhost:11434/v1/models 載入模型清單。

# SettingsLlmLoadOllamaCloudModels
source: Load Ollama Cloud Models
ja_jp: Ollama Cloudモデルを取得
zh_hans: 加载Ollama Cloud型号
zh_hant: 加載Ollama Cloud型號

# SettingsLlmOllamaCloudInfo
source: Ollama Cloud loads the list of models from the specified endpoint.
ja_jp: Ollama Cloudは、指定されたエンドポイントからモデルリストを取得します。
zh_hans: Ollama Cloud 从指定端点加载模型列表。
zh_hant: Ollama Cloud 從指定端點載入模型清單。

# SettingsLlmVisionFallbackProvider
source: Vision fallback provider
zh_hans: 视觉回退提供商
zh_hant: 視覺備援提供者

# SettingsLlmVisionFallbackModel
source: Vision fallback model
zh_hans: 视觉回退模型
zh_hant: 視覺備援模型

# SettingsLlmTokenUsageStatsLabel
source: Token statistics
ja_jp: Token統計
zh_hans: Token 统计
zh_hant: Token 統計

# SettingsLlmTokenUsageStatsButton
source: Open token statistics in editor
ja_jp: Token統計をエディターで開く
zh_hans: 在编辑器中打开 token 统计
zh_hant: 在編輯器中開啟 token 統計

# SettingsLlmTokenUsageStatsEmpty
source: No LLM token usage has been observed yet.
ja_jp: まだLLM token usageは観測されていません。
zh_hans: 尚未观测到 LLM token usage。
zh_hant: 尚未觀測到 LLM token usage。

# SettingsLlmTokenUsageStatsSummaryFormat
source: Total: {0:N0} requests · input {1:N0} · output {2:N0} · total {3:N0} · cached {4:N0} tokens
ja_jp: 累計: リクエスト {0:N0}回 · 入力 {1:N0} · 出力 {2:N0} · 合計 {3:N0} · cached {4:N0}トークン
zh_hans: 累计：请求 {0:N0} 次 · 输入 {1:N0} · 输出 {2:N0} · 总计 {3:N0} · cached {4:N0} tokens
zh_hant: 累計：請求 {0:N0} 次 · 輸入 {1:N0} · 輸出 {2:N0} · 總計 {3:N0} · cached {4:N0} tokens

# SettingsLlmTokenUsageStatsLastFormat
source: Last: {0} / {1} · {2:N0} request · input {3:N0} · output {4:N0} · total {5:N0} · cached {6:N0} tokens
ja_jp: 最後: {0} / {1} · リクエスト {2:N0}回 · 入力 {3:N0} · 出力 {4:N0} · 合計 {5:N0} · cached {6:N0}トークン
zh_hans: 最后一次：{0} / {1} · 请求 {2:N0} 次 · 输入 {3:N0} · 输出 {4:N0} · 总计 {5:N0} · cached {6:N0} tokens
zh_hant: 最後一次：{0} / {1} · 請求 {2:N0} 次 · 輸入 {3:N0} · 輸出 {4:N0} · 總計 {5:N0} · cached {6:N0} tokens

# SettingsLlmTokenUsageStatsBucketLineFormat
source: {0} / {1}: {2:N0} requests · input {3:N0} · output {4:N0} · total {5:N0} · cached {6:N0} tokens
ja_jp: {0} / {1}: リクエスト {2:N0}回 · 入力 {3:N0} · 出力 {4:N0} · 合計 {5:N0} · cached {6:N0}トークン
zh_hans: {0} / {1}：请求 {2:N0} 次 · 输入 {3:N0} · 输出 {4:N0} · 总计 {5:N0} · cached {6:N0} tokens
zh_hant: {0} / {1}：請求 {2:N0} 次 · 輸入 {3:N0} · 輸出 {4:N0} · 總計 {5:N0} · cached {6:N0} tokens

# SettingsLlmTokenUsageStatsByProviderModel
source: By provider/model
ja_jp: プロバイダー/モデル別
zh_hans: 按供应商/模型
zh_hant: 依供應商/模型

# SettingsLlmTokenUsageStatsByDay
source: Daily
ja_jp: 日別
zh_hans: 每日
zh_hant: 每日

# SettingsLlmTokenUsageStatsByMonth
source: Monthly
ja_jp: 月別
zh_hans: 每月
zh_hant: 每月

# SettingsLlmTokenUsageStatsPeriodLineFormat
source: {0}: {1:N0} requests · input {2:N0} · output {3:N0} · total {4:N0} · cached {5:N0} tokens
ja_jp: {0}: リクエスト {1:N0}回 · 入力 {2:N0} · 出力 {3:N0} · 合計 {4:N0} · cached {5:N0}トークン
zh_hans: {0}：请求 {1:N0} 次 · 输入 {2:N0} · 输出 {3:N0} · 总计 {4:N0} · cached {5:N0} tokens
zh_hant: {0}：請求 {1:N0} 次 · 輸入 {2:N0} · 輸出 {3:N0} · 總計 {4:N0} · cached {5:N0} tokens

# SettingsLlmTokenUsageStatsReset
source: Reset statistics
ja_jp: 統計をリセット
zh_hans: 重置统计
zh_hant: 重設統計

# SettingsLlmTokenUsageUnknownProvider
source: Unknown provider
ja_jp: 不明なプロバイダー
zh_hans: 未知供应商
zh_hant: 未知供應商

# SettingsLlmTokenUsageUnknownModel
source: Unknown model
ja_jp: 不明なモデル
zh_hans: 未知模型
zh_hant: 未知模型

# SettingsLlmApiKeyInfo
source: API Keys are stored in the Windows Credential Manager, not in settings files.
ja_jp: APIキーは設定ファイルではなく、Windowsの資格情報マネージャーに保存されます。
zh_hans: API Key 存储在 Windows Credential Manager 中，而不是存储在设置文件中。
zh_hant: API Key 儲存在 Windows Credential Manager 中，而不是儲存在設定檔中。

# SettingsLlmCredentialPlaceholder
source: Enter API Key (leave empty to delete saved credential)
ja_jp: APIキーを入力（空欄にすると保存済みの資格情報を削除）
zh_hans: 输入 API Key（留空将删除保存的凭据）
zh_hant: 輸入 API Key（留空將刪除已儲存的憑證）

# SettingsLlmCredentialInfo
source: API Keys are stored in the Windows Credential Manager, not in settings files.
ja_jp: APIキーは設定ファイルではなく、Windowsの資格情報マネージャーに保存されます。
zh_hans: API Key 不保存在设置文件中，而是存储在 Windows 凭据管理器。
zh_hant: API Key 不會儲存在設定檔，而是存放於 Windows 認證管理員。

# SettingsLlmOAuthAccessTokenName
source: OAuth Access Token
zh_hans: OAuth 访问令牌
zh_hant: OAuth 存取令牌

# SettingsLlmCredentialSavedFormat
source: {0} {1} has been saved to Windows Credential Manager.
ja_jp: {0} {1}をWindows資格情報マネージャーに保存しました。
zh_hans: {0} {1} 已保存到 Windows Credential Manager。
zh_hant: {0} {1} 已儲存至 Windows Credential Manager。

# SettingsLlmCredentialDeletedFormat
source: {0} {1} has been deleted from Windows Credential Manager.
ja_jp: {0} {1}をWindows資格情報マネージャーから削除しました。
zh_hans: {0} {1} 已从 Windows Credential Manager 中删除。
zh_hant: {0} {1} 已從 Windows Credential Manager 刪除。

# SettingsLlmConfirmBeforeSending
source: Confirm before sending
ja_jp: 送信前に確認
zh_hans: 发送前确认
zh_hant: 傳送前確認

# SettingsLlmSourceLanguage
source: Source Language
ja_jp: 翻訳元言語 (Source Language)
zh_hans: 源语言
zh_hant: 來源語言

# SettingsLlmMaxToolCalls
source: Max Tool Calls
ja_jp: ツール呼び出し最大回数 (0 = デフォルト)
zh_hans: 最大工具调用次数（0 = 使用默认值）
zh_hant: 最大工具呼叫次數

# SettingsLlmTargetLanguage
source: Target Language
ja_jp: 翻訳先言語 (Target Language)
zh_hans: 目标语言
zh_hant: 目標語言

# LlmTargetLanguageDefault
source: Default (UI Language)
ja_jp: デフォルト (UI言語)
zh_hans: 默认（界面语言）
zh_hant: 預設（介面語言）

# LlmLangAutoDetect
source: Auto Detect
ja_jp: 自動検出 (Auto Detect)
zh_hans: 自动检测
zh_hant: 自動偵測

# LlmLangKorean
source: Korean
ja_jp: 韓国語 (Korean)
zh_hans: 韩语 (Korean)
zh_hant: 韓文 (Korean)

# LlmLangEnglish
source: English
ja_jp: 英語 (English)
zh_hans: 英语 (English)
zh_hant: 英文 (English)

# LlmLangJapanese
source: Japanese
ja_jp: 日本語 (Japanese)
zh_hans: 日语 (Japanese)
zh_hant: 日文 (Japanese)

# LlmLangChinese
source: Chinese
ja_jp: 中国語 (Chinese)
zh_hans: 中文 (Chinese)
zh_hant: 中文 (Chinese)

# LlmLangChineseSimplified
source: Chinese (Simplified)
ja_jp: 中国語（簡体字 / Simplified Chinese）
zh_hans: 简体中文 (Simplified Chinese)
zh_hant: 簡體中文 (Simplified Chinese)

# LlmLangChineseTraditional
source: Chinese (Traditional)
ja_jp: 中国語（繁体字 / Traditional Chinese）
zh_hans: 繁体中文 (Traditional Chinese)
zh_hant: 繁體中文 (Traditional Chinese)

# LlmLangFrench
source: French
ja_jp: フランス語 (French)
zh_hans: 法语 (French)
zh_hant: 法文 (French)

# LlmLangSpanish
source: Spanish
ja_jp: スペイン語 (Spanish)
zh_hans: 西班牙语 (Spanish)
zh_hant: 西班牙文 (Spanish)

# LlmLangGerman
source: German
ja_jp: ドイツ語 (German)
zh_hans: 德语 (German)
zh_hant: 德文 (German)

# SelectionNoneBlocked
source: Selection: None (Use file context for whole file)
ja_jp: 選択範囲: なし (ファイル全体の場合はファイル追加を使用)
zh_hans: 选择：无（对整个文件使用文件上下文）
zh_hant: 選擇：無（對整個文件使用文件上下文）

# SelectionStats
source: Selection: {0} chars (approx {1} tokens)
ja_jp: 選択範囲: {0} 文字 (約 {1} トークン)
zh_hans: 选择：{0} 个字符（大约 {1} 代币）
zh_hant: 選擇：{0} 個字元（大約 {1} 代幣）

# SearchHeader
source: Search & Replace in Folder
ja_jp: フォルダ内検索と置換
zh_hans: 在文件夹中搜索和替换
zh_hant: 在資料夾中搜尋和替換

# SearchPlaceholder
source: Enter search term...
ja_jp: 検索語を入力...
zh_hans: Enter 搜索词...
zh_hant: Enter 搜尋字詞...

# ReplacePlaceholder
source: Enter replacement...
ja_jp: 置換する文字列を入力...
zh_hans: Enter 替换...
zh_hant: Enter 替換...

# SearchMatchCaseTooltip
source: Match Case
ja_jp: 大文字小文字を区別
zh_hans: 火柴盒
zh_hant: 火柴盒

# SearchWholeWordTooltip
source: Whole Word
ja_jp: 単語単位
zh_hans: 整个词
zh_hant: 整個詞

# SearchAllFiles
source: Search All
ja_jp: すべて検索
zh_hans: 搜索全部
zh_hant: 搜尋全部

# ReplaceAllFiles
source: Replace All
ja_jp: すべて置換
zh_hans: 全部替换
zh_hant: 全部替換

# RecentFilesHeader
source: Recent Files (Double-click to open)
ja_jp: 最近のファイル (ダブルクリックで開く)
zh_hans: 最近使用的文件（双击打开）
zh_hant: 最近使用的檔案（雙擊開啟）

# GitRepoHeader
source: Git Repository
ja_jp: Git リポジトリ
zh_hans: Git 存储库
zh_hant: Git 儲存庫

# GitRepoPathLabel
source: Path
ja_jp: パス
zh_hans: 路径
zh_hant: 路徑

# GitRepoPathNone
source: No Root Path
ja_jp: ルートパスなし
zh_hans: 无根路径
zh_hant: 無根路徑

# GitBranchPlaceholder
source: Branch List
ja_jp: ブランチ一覧
zh_hans: 分行列表
zh_hant: 分行列表

# GitCommitPlaceholder
source: Enter commit message...
ja_jp: コミットメッセージを入力...
zh_hans: Enter 提交消息...
zh_hant: Enter 提交訊息...

# GitCommit
source: Commit
ja_jp: コミット
zh_hans: 提交
zh_hant: 提交

# GitStageAll
source: Stage All
ja_jp: すべてステージ
zh_hans: 舞台全部
zh_hant: 舞台全部

# GitRestoreAll
source: Restore All
ja_jp: すべて復元
zh_hans: 全部恢复
zh_hant: 全部恢復

# GitPush
source: Push
zh_hans: 推
zh_hant: 推

# GitPushMenuTooltip
source: Git actions
ja_jp: Git 操作
zh_hans: Git 行动
zh_hant: Git 行動

# GitPushSuccessTitle
source: Git Push
zh_hans: Git 推
zh_hant: Git 推

# GitPushSuccessMessage
source: Push completed.
ja_jp: Push が完了しました。
zh_hans: 推送完成。
zh_hant: 推送完成。

# GitPushFailureTitle
source: Git Push Failed
ja_jp: Git Push 失敗
zh_hans: Git 推送失败
zh_hant: Git 推播失敗

# GitPushFailureMessage
source: Push failed. Check the remote repository, authentication, or upstream setting.
ja_jp: Push に失敗しました。リモートリポジトリ、認証、またはアップストリーム設定を確認してください。
zh_hans: 推送失败。检查远程存储库、身份验证或上游设置。
zh_hant: 推送失敗。檢查遠端儲存庫、身份驗證或上游設定。

# GitPull
source: Pull
zh_hans: 拉动
zh_hant: 拉動

# GitRebase
source: Rebase
zh_hans: 变基
zh_hant: 變基

# GitCreateBranch
source: Create Branch
ja_jp: ブランチ作成
zh_hans: 创建分支
zh_hant: 建立分支

# GitMerge
source: Merge Branch
ja_jp: マージ
zh_hans: 合并
zh_hant: 合併分支

# GitCreateBranchTitle
source: Create New Branch
ja_jp: 新しいブランチの作成
zh_hans: 创建新分支
zh_hant: 建立新分支

# GitCreateBranchPlaceholder
source: Enter branch name...
ja_jp: ブランチ名を入力してください...
zh_hans: 输入分支名称...
zh_hant: 輸入分支名稱...

# GitCreateBranchConfirm
source: Create
ja_jp: 作成
zh_hans: 创建
zh_hant: 建立

# GitCreateBranchSuccessTitle
source: Branch Created Successfully
ja_jp: ブランチ作成に成功しました
zh_hans: 分支创建成功
zh_hant: 分支建立成功

# GitCreateBranchSuccessMessage
source: Branch '{0}' has been created and checked out.
ja_jp: ブランチ '{0}' が作成され、チェックアウトされました。
zh_hans: 分支 '{0}' 已创建并检出。
zh_hant: 分支 '{0}' 已建立並切換。

# GitCreateBranchFailureTitle
source: Branch Creation Failed
ja_jp: ブランチ作成失敗
zh_hans: 分支创建失败
zh_hant: 分支建立失敗

# GitCreateBranchFailureMessage
source: Failed to create branch. Error: {0}
ja_jp: ブランチの作成に失敗しました。エラー: {0}
zh_hans: 无法创建分支。错误: {0}
zh_hant: 無法建立分支。錯誤: {0}

# GitMergeTitle
source: Merge Branch
ja_jp: ブランチの合流 (マージ)
zh_hans: 合并分支
zh_hant: 合併分支

# GitMergeLabel
source: Select a branch to merge into current branch:
ja_jp: 現在のブランチにマージするブランチを選択してください:
zh_hans: 选择要合并到当前分支的分支：
zh_hant: 選擇要合併到目前分支的分支：

# GitMergeConfirm
source: Merge
ja_jp: マージ
zh_hans: 合并
zh_hant: 合併

# GitMergeCancel
source: Cancel
ja_jp: キャンセル
zh_hans: 取消
zh_hant: 取消

# GitMergeSuccessTitle
source: Merge Successful
ja_jp: マージ成功
zh_hans: 合并成功
zh_hant: 合併成功

# GitMergeSuccessMessage
source: Branch '{0}' has been successfully merged.
ja_jp: ブランチ '{0}' が正常にマージされました。
zh_hans: 分支 '{0}' 已成功合并。
zh_hant: 分支 '{0}' 已成功合併。

# GitMergeFailureTitle
source: Merge Failed
ja_jp: マージ失敗
zh_hans: 合并失败
zh_hant: 合併失敗

# GitMergeFailureMessage
source: An error occurred during merge or there are conflicts. {0}
ja_jp: マージ中にエラーが発生したか、衝突があります。{0}
zh_hans: 合并过程中发生错误或存在冲突。{0}
zh_hant: 合併過程中發生錯誤或存在衝突。{0}

# GitMergeNoBranchesMessage
source: There are no other branches to merge.
ja_jp: マージする他のブランチがありません。
zh_hans: 没有其他可合并的分支。
zh_hant: 沒有其他可合併的分支。
